pages/hugo.org
#+setupfile:./hugo_setup.org
#+hugo_slug: hugo
#+TITLE: Hugo

Hugo is the static site generator I use to maintain my web spaces, including this site.

* Themes
[[https://themes.gohugo.io/hugonews/][Hugo News]], an imitation of Hacker News for a personal bookmarking website. Sharing all of my bookmarks is a good idea!
[[https://themes.gohugo.io/the-roots-home/][The Roots]], a theme for listing site contents as directories. Similar to a file server interface for the web, but with more customization.
* Tools
[[https://themes.gohugo.io//theme/hugo-theme-codex/blog/math-typesetting/][Math Typesetting]]
[[https://willschenk.com/articles/2019/using_org_mode_in_hugo/][Org mode tweaks for using it in Hugo]]
https://github.com/lopes/zola.386 zola killer 90s theme
https://www.youtube.com/watch?v=LCdG6KPE35M&app=desktop
