content/posts/hugo.md
+++
title = "Hugo"
author = ["Jacob Chvatal"]
lastmod = 2020-10-14T22:16:16+02:00
slug = "hugo"
draft = false
+++

Hugo is the static site generator I use to maintain my web spaces, including this site.


## Themes {#themes}

[Hugo News](https://themes.gohugo.io/hugonews/), an imitation of Hacker News for a personal bookmarking website. Sharing all of my bookmarks is a good idea!
[The Roots](https://themes.gohugo.io/the-roots-home/), a theme for listing site contents as directories. Similar to a file server interface for the web, but with more customization.


## Tools {#tools}

[Math Typesetting](https://themes.gohugo.io//theme/hugo-theme-codex/blog/math-typesetting/)
[Org mode tweaks for using it in Hugo](https://willschenk.com/articles/2019/using%5Forg%5Fmode%5Fin%5Fhugo/)
<https://github.com/lopes/zola.386> zola killer 90s theme
<https://www.youtube.com/watch?v=LCdG6KPE35M&app=desktop>
